package lesson03;

/**
 * Да се състави програма, чрез която се извежда квадрат от цифри. Сумите от
 * елементите на произволен ред или стълб са равни на 45. Пример:
 * ..1..2..3..4..5..6..7..8..9..0.. ..2..3..4..5..6..7..8..9..0..1..
 * ..3..4..5..6..7..8..9..0..1..2.. ..4..5..6..7..8..9..0..1..2..3..
 * ..5..6..7..8..9..0..1..2..3..4.. ..6..7..8..9..0..1..2..3..4..5..
 * ..7..8..9..0..1..2..3..4..5..6.. ..8..9..0..1..2..3..4..5..6..7..
 * ..9..0..1..2..3..4..5..6..7..8.. ..0..1..2..3..4..5..6..7..8..9..
 */
public class Zadacha20 {

	public static void main(String[] args) {

		for (int i = 1; i <= 10; i++) {
			for (int j = i; j < (10 + i); j++) {
				if (j >= 10) {
					System.out.print((j % 10) + " ");
					continue;
				}
				System.out.print(j + " ");
			}
			System.out.print("\n");

		}
	}
}
